In [1]:
import pandas as pd

In [2]:
data = {'city': ['Lahore', 'Lahore', ' Lahore', 
                 'Multan', 'Multan', 'Mltan'],
       'year':[ 2010,2011,2012, 2010,2011,2012],
        'population':[ 10.0, 10.1,10.2,5.2,5.3,5.5]}

In [3]:
print(data)

{'city': ['Lahore', 'Lahore', ' Lahore', 'Multan', 'Multan', 'Mltan'], 'year': [2010, 2011, 2012, 2010, 2011, 2012], 'population': [10.0, 10.1, 10.2, 5.2, 5.3, 5.5]}

In [4]:
print(type(data))

<class 'dict'>

In [5]:
#creating data frame
df1 = pd.DataFrame(data)

In [6]:
df1

      city  year  population
0   Lahore  2010        10.0
1   Lahore  2011        10.1
2   Lahore  2012        10.2
3   Multan  2010         5.2
4   Multan  2011         5.3
5    Mltan  2012         5.5

In [7]:
df1.head()

      city  year  population
0   Lahore  2010        10.0
1   Lahore  2011        10.1
2   Lahore  2012        10.2
3   Multan  2010         5.2
4   Multan  2011         5.3

In [8]:
df1.tail()

      city  year  population
1   Lahore  2011        10.1
2   Lahore  2012        10.2
3   Multan  2010         5.2
4   Multan  2011         5.3
5    Mltan  2012         5.5

In [12]:
df = pd.DataFrame(data, columns = ['year', 'city', 'population'])

In [13]:
df

   year     city  population
0  2010   Lahore        10.0
1  2011   Lahore        10.1
2  2012   Lahore        10.2
3  2010   Multan         5.2
4  2011   Multan         5.3
5  2012    Mltan         5.5

In [14]:
df3= pd.DataFrame(data, columns = ['year', 'city', 'population', 'GDP'],
                 index= ['one', 'two', 'three', 'four','five','six'])

In [15]:
df3

       year     city  population  GDP
one    2010   Lahore        10.0  NaN
two    2011   Lahore        10.1  NaN
three  2012   Lahore        10.2  NaN
four   2010   Multan         5.2  NaN
five   2011   Multan         5.3  NaN
six    2012    Mltan         5.5  NaN

In [18]:
print(df3.columns)

Index(['year', 'city', 'population', 'GDP'], dtype='object')

In [19]:
df3.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [20]:
df3.year

one      2010
two      2011
three    2012
four     2010
five     2011
six      2012
Name: year, dtype: int64

In [21]:
df3['year']

one      2010
two      2011
three    2012
four     2010
five     2011
six      2012
Name: year, dtype: int64

In [22]:
df3['year'].dtype

dtype('int64')

In [23]:
df3.dtypes

year            int64
city           object
population    float64
GDP            object
dtype: object

In [24]:
df3.loc['one']

year            2010
city          Lahore
population        10
GDP              NaN
Name: one, dtype: object

In [26]:
df3.GDP = 10

print(df3)

       year     city  population  GDP
one    2010   Lahore        10.0   10
two    2011   Lahore        10.1   10
three  2012   Lahore        10.2   10
four   2010   Multan         5.2   10
five   2011   Multan         5.3   10
six    2012    Mltan         5.5   10

In [27]:
import numpy as np

In [28]:
df3.GDP = np.arange(6)
print(df3)

       year     city  population  GDP
one    2010   Lahore        10.0    0
two    2011   Lahore        10.1    1
three  2012   Lahore        10.2    2
four   2010   Multan         5.2    3
five   2011   Multan         5.3    4
six    2012    Mltan         5.5    5

In [29]:
df3.GDP = [3,2,0,9, -0.4, 7]
print(df3)

       year     city  population  GDP
one    2010   Lahore        10.0  3.0
two    2011   Lahore        10.1  2.0
three  2012   Lahore        10.2  0.0
four   2010   Multan         5.2  9.0
five   2011   Multan         5.3 -0.4
six    2012    Mltan         5.5  7.0

In [31]:
val = pd.Series([-1.4, 1.5 , -1.3 ], index =['two', 'four', 'five'])

In [32]:
df3.GDP = val
print(df3)

       year     city  population  GDP
one    2010   Lahore        10.0  NaN
two    2011   Lahore        10.1 -1.4
three  2012   Lahore        10.2  NaN
four   2010   Multan         5.2  1.5
five   2011   Multan         5.3 -1.3
six    2012    Mltan         5.5  NaN